In [1]:
import pandas as pd

In [2]:
df =  pd.read_csv('./data/users.csv')

In [3]:
df.head()

,id,firstname,lastname,email,email2,profession,age
0,100,Glenda,Pyle,Glenda.Pyle@yopmail.com,Glenda.Pyle@gmail.com,firefighter,25.0
1,101,Hollie,Allys,Hollie.Allys@yopmail.com,Hollie.Allys@gmail.com,worker,26.0
2,102,Grier,Henrie,Grier.Henrie@yopmail.com,Grier.Henrie@gmail.com,doctor,23.0
3,103,Kittie,Strephon,Kittie.Strephon@yopmail.com,Kittie.Strephon@gmail.com,worker,45.0
4,104,Kassey,Prober,Kassey.Prober@yopmail.com,Kassey.Prober@gmail.com,worker,45.0

In [6]:
df_group = (
    df
    .groupby('profession')
    .agg(
        avg_age=('age', 'mean'),
        min_age=('age', 'min'),
        max_age=('age', 'max')
    )
)

In [7]:
df_group

                avg_age  min_age  max_age
profession
developer         25.50     19.0     32.0
doctor            28.00     23.0     33.0
firefighter       34.25     23.0     46.0
police officer    41.00     41.0     41.0
worker            34.75     23.0     45.0